#7.1 데이터합치기

##7.1.1 데이터베이스 스타일로 DataFrame 합치기

In [2]:
import pandas as pd
from pandas import DataFrame

In [3]:
df1 = DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [4]:
df2= DataFrame({'key':['a','b','d'],'data2':range(3)})

In [5]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [6]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [7]:
pd.merge(df1,df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [8]:
pd.merge(df1,df2,on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [9]:
df3=DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})

In [10]:
df4 =DataFrame({'rkey':['a','b','d'],'data1':range(3)})

In [11]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

   data1_x lkey  data1_y rkey
0        0    b        1    b
1        1    b        1    b
2        6    b        1    b
3        2    a        0    a
4        4    a        0    a
5        5    a        0    a

In [12]:
pd.merge(df1,df2,how='outer')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0
6      3   c    NaN
7    NaN   d      2

In [13]:
df1=DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [14]:
df2=DataFrame({'key':['a','b','a','b','d'],'data1':range(5)})

In [15]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [16]:
df2

   data1 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [17]:
pd.merge(df1,df2,on='key',how='left')

    data1_x key  data1_y
0         0   b        1
1         0   b        3
2         1   b        1
3         1   b        3
4         2   a        0
5         2   a        2
6         3   c      NaN
7         4   a        0
8         4   a        2
9         5   b        1
10        5   b        3

In [18]:
pd.merge(df1,df2,how='inner')

   data1 key
0      1   b
1      2   a

In [19]:
left=DataFrame({'key1':['foo','foo','bar'],'key2':['one','two','one'],'lval':[1,2,3]})

In [20]:
right=DataFrame({'key1':['foo','foo','bar','bar'],'key2':['one','one','one','two'],'rval':[4,5,6,7]})

In [21]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2   NaN
3  bar  one     3     6
4  bar  two   NaN     7

In [22]:
pd.merge(left,right,on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [23]:
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

## 7.1.2 색인 머지하기

In [24]:
left1=DataFrame({'key':['a','b','a','a','b','c'],
                'value':range(6)})

In [25]:
right1=DataFrame({'group_val':[3.5,7]},index=['a','b'])

In [26]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [27]:
right1

   group_val
a        3.5
b        7.0

In [28]:
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [29]:
pd.merge(left1,right1,left_on='key',right_index=True,how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [31]:
import numpy as np
lefth=DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],'key2':[2000,2001,2002,2001,2002],'data':np.arange(5.)})

In [32]:
righth=DataFrame(np.arange(12).reshape((6,2)),index=[['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],[2001,2000,2000,2000,2001,2002]],
                columns=['event1','event2'])

In [33]:
lefth

   data    key1  key2
0     0    Ohio  2000
1     1    Ohio  2001
2     2    Ohio  2002
3     3  Nevada  2001
4     4  Nevada  2002

In [34]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [35]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

   data    key1  key2  event1  event2
0     0    Ohio  2000       4       5
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1

In [36]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True,how='outer')

   data    key1  key2  event1  event2
0     0    Ohio  2000       4       5
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1
4     4  Nevada  2002     NaN     NaN
4   NaN  Nevada  2000       2       3

In [37]:
left2=DataFrame([[1.,2.],[3.,4],[5.,6.]],index=['a','c','e'],columns=['Ohio','Nevada'])

In [38]:
right2=DataFrame([[7.,8.],[9.,10],[11.,12.],[13.,14.]],index=['b','c','d','e'],columns=['Missouri','Alabama'])

In [39]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [40]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [41]:
pd.merge(left2,right2,how='outer',left_index=True,right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
b   NaN     NaN         7        8
c     3       4         9       10
d   NaN     NaN        11       12
e     5       6        13       14

In [42]:
left2.join(right2,how='outer')

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
b   NaN     NaN         7        8
c     3       4         9       10
d   NaN     NaN        11       12
e     5       6        13       14

In [43]:
left1.join(right1,on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [44]:
another=DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],index=['a','c','e','f'],columns=['New York','Oregon'])

In [45]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2       NaN      NaN         7       8
c     3       4         9       10         9      10
e     5       6        13       14        11      12

In [46]:
left2.join([right2,another],how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2       NaN      NaN         7       8
b   NaN     NaN         7        8       NaN     NaN
c     3       4         9       10         9      10
d   NaN     NaN        11       12       NaN     NaN
e     5       6        13       14        11      12
f   NaN     NaN       NaN      NaN        16      17

## 7.1.3 축 따라 이어붙이기

In [47]:
import numpy as np
from pandas import Series

In [48]:
arr=np.arange(12).reshape((3,4))

In [49]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [50]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [51]:
s1=Series([0,1],index=['a','b'])

In [52]:
s2=Series([2,3,4],index=['c','d','e'])

In [53]:
s3=Series([5,6],index=['f','g'])

In [54]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [55]:
pd.concat([s1,s2,s3],axis=1)

    0   1   2
a   0 NaN NaN
b   1 NaN NaN
c NaN   2 NaN
d NaN   3 NaN
e NaN   4 NaN
f NaN NaN   5
g NaN NaN   6

In [56]:
s4=pd.concat([s1*5,s3])

In [57]:
pd.concat([s1,s4],axis=1)

    0  1
a   0  0
b   1  5
f NaN  5
g NaN  6

In [58]:
pd.concat([s1,s4],axis=1,join='inner')

   0  1
a  0  0
b  1  5

In [59]:
pd.concat([s1,s4],axis=1,join_axes=[['a','c','b','e']])

    0   1
a   0   0
c NaN NaN
b   1   5
e NaN NaN

In [60]:
result=pd.concat([s1,s1,s3],keys=['one','two','three'])

In [61]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [62]:
result.unstack()

        a   b   f   g
one     0   1 NaN NaN
two     0   1 NaN NaN
three NaN NaN   5   6

In [63]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'])

   one  two  three
a    0  NaN    NaN
b    1  NaN    NaN
c  NaN    2    NaN
d  NaN    3    NaN
e  NaN    4    NaN
f  NaN  NaN      5
g  NaN  NaN      6

In [64]:
df1=DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],columns=['one','two'])

In [65]:
df2=DataFrame(5+np.arange(4).reshape(2,2),index=['a','c'],columns=['three','four'])

In [66]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'])

  level1     level2
     one two  three four
a      0   1      5    6
b      2   3    NaN  NaN
c      4   5      7    8

In [67]:
pd.concat({'level1':df1,'level2':df2},axis=1)

  level1     level2
     one two  three four
a      0   1      5    6
b      2   3    NaN  NaN
c      4   5      7    8

In [68]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],names=['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1      5    6
b          2   3    NaN  NaN
c          4   5      7    8

In [69]:
df1=DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])

In [70]:
df2=DataFrame(np.random.randn(2,3),columns=['b','d','a'])

In [71]:
df1

          a         b         c         d
0 -0.761785 -0.002295 -1.168228 -1.854503
1  0.589162  1.678315  0.009742 -0.580604
2 -0.366211 -0.398800 -0.300640 -0.037674

In [72]:
df2

          b         d         a
0 -1.696579 -0.440273 -0.072470
1  0.809514  0.820798 -0.185565

In [73]:
pd.concat([df1,df2],ignore_index=True)

          a         b         c         d
0 -0.761785 -0.002295 -1.168228 -1.854503
1  0.589162  1.678315  0.009742 -0.580604
2 -0.366211 -0.398800 -0.300640 -0.037674
3 -0.072470 -1.696579       NaN -0.440273
4 -0.185565  0.809514       NaN  0.820798

## 7.1.4 겹치는 데이터 합치기

In [74]:
a=Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],index=['f','e','d','c','b','a'])

In [75]:
b=Series(np.arange(len(a),dtype=np.float64),index=['f','e','d','c','b','a'])

In [76]:
b[-1]=np.nan

In [77]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [78]:
b

f     0
e     1
d     2
c     3
b     4
a   NaN
dtype: float64

In [79]:
np.where(pd.isnull(a),b,a)

array([ 0. ,  2.5,  2. ,  3.5,  4.5,  nan])

In [80]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [81]:
df1=DataFrame({'a':[1.,np.nan,5.,np.nan],'b':[np.nan,2.,np.nan,6.],'c':range(2,18,4)})

In [82]:
df2=DataFrame({'a':[5.,4.,np.nan,3.,7.],'b':[np.nan,3.,4.,6.,8.]})

In [83]:
df1.combine_first(df2)

   a   b   c
0  1 NaN   2
1  4   2   6
2  5   4  10
3  3   6  14
4  7   8 NaN

# 7.1 재형성과 피벗

## 7.2.1 계층적 색인으로 재형성하기

In [84]:
data=DataFrame(np.arange(6).reshape((2,3)),index=pd.Index(['Ohio','Colorado'],name='state'),columns=pd.Index(['one','two','three'],name='number'))

In [85]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [86]:
result=data.stack()

In [87]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [88]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [89]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [90]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [91]:
s1=Series([0,1,2,3],index=['a','b','c','d'])

In [92]:
s2=Series([4,5,6],index=['c','d','e'])

In [93]:
data2=pd.concat([s1,s2],keys=['one','two'])

In [94]:
data2.unstack()

      a   b  c  d   e
one   0   1  2  3 NaN
two NaN NaN  4  5   6

In [95]:
data2.unstack().stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: float64

In [96]:
data2.unstack().stack(dropna=False)

one  a     0
     b     1
     c     2
     d     3
     e   NaN
two  a   NaN
     b   NaN
     c     4
     d     5
     e     6
dtype: float64

In [97]:
df=DataFrame({'left':result,'right':result+5},columns=pd.Index(['left','right'],name='side'))

In [98]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [99]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [100]:
df.unstack('state').stack('side')

state         Ohio  Colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

## 7.2.2 피버팅으로 데이터 나열 방식 바꾸기

In [103]:
data = pd.read_csv('https://raw.githubusercontent.com/pydata/pydata-book/master/ch07/macrodata.csv')
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')
data = DataFrame(data.to_records(),
                 columns=pd.Index(['realgdp', 'infl', 'unemp'], name='item'),
                 index=periods.to_timestamp('D', 'end'))

ldata = data.stack().reset_index().rename(columns={0: 'value'})
wdata = ldata.pivot('date', 'item', 'value')

In [105]:
ldata[:10]

        date     item     value
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340
5 1959-06-30    unemp     5.100
6 1959-09-30  realgdp  2775.488
7 1959-09-30     infl     2.740
8 1959-09-30    unemp     5.300
9 1959-12-31  realgdp  2785.204

In [107]:
pivoted=ldata.pivot('date','item','value')

In [108]:
pivoted.head()

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31  0.27  2785.204    5.6
1960-03-31  2.31  2847.699    5.2

In [109]:
ldata['value2']=np.random.randn(len(ldata))

In [110]:
ldata[:10]

        date     item     value    value2
0 1959-03-31  realgdp  2710.349 -1.422714
1 1959-03-31     infl     0.000  0.966024
2 1959-03-31    unemp     5.800 -0.948960
3 1959-06-30  realgdp  2778.801 -1.130630
4 1959-06-30     infl     2.340 -0.375224
5 1959-06-30    unemp     5.100  1.515372
6 1959-09-30  realgdp  2775.488 -0.353981
7 1959-09-30     infl     2.740 -1.346691
8 1959-09-30    unemp     5.300 -1.916534
9 1959-12-31  realgdp  2785.204  0.876434

In [111]:
pivoted=ldata.pivot('date','item')

In [112]:
pivoted[:5]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8  0.966024 -1.422714 -0.948960
1959-06-30  2.34  2778.801   5.1 -0.375224 -1.130630  1.515372
1959-09-30  2.74  2775.488   5.3 -1.346691 -0.353981 -1.916534
1959-12-31  0.27  2785.204   5.6  0.458034  0.876434  0.052217
1960-03-31  2.31  2847.699   5.2 -0.052070  0.543588  0.630162

In [113]:
pivoted['value'][:5]

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31  0.27  2785.204    5.6
1960-03-31  2.31  2847.699    5.2

In [114]:
unstacked=ldata.set_index(['date','item']).unstack('item')

In [115]:
unstacked[:7]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8  0.966024 -1.422714 -0.948960
1959-06-30  2.34  2778.801   5.1 -0.375224 -1.130630  1.515372
1959-09-30  2.74  2775.488   5.3 -1.346691 -0.353981 -1.916534
1959-12-31  0.27  2785.204   5.6  0.458034  0.876434  0.052217
1960-03-31  2.31  2847.699   5.2 -0.052070  0.543588  0.630162
1960-06-30  0.14  2834.390   5.2 -1.198659 -0.393127  0.634145
1960-09-30  2.70  2839.022   5.6 -0.422911 -0.560287  1.457080

# 7.3 데이터 변형

## 7.3.1 중복 제거하기

In [116]:
data=DataFrame({'k1':['one']*3+['two']*4,'k2':[1,1,2,3,3,4,4,]})

In [117]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [118]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [119]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [120]:
data['v1']=range(7)

In [121]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [122]:
data.drop_duplicates(['k1','k2'],take_last=True)

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

## 7.3.2 함수나 매핑 이용해 데이터 변형하기

In [123]:
data=DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [124]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [128]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami': 'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [129]:
data['animal']=data['food'].map(str.lower).map(meat_to_animal)

In [130]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [131]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 7.3.3 값 치환하기

In [132]:
data=Series([1.,-999.,2.,-999.,-1000.,3])

In [133]:
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: float64

In [135]:
data.replace(-999,np.nan)

0       1
1     NaN
2       2
3     NaN
4   -1000
5       3
dtype: float64

In [136]:
data.replace([-999,-1000],[np.nan,0])

0     1
1   NaN
2     2
3   NaN
4     0
5     3
dtype: float64

In [137]:
data.replace([-999,-1000],[np.nan,0])

0     1
1   NaN
2     2
3   NaN
4     0
5     3
dtype: float64

In [138]:
data.replace({-999:np.nan,-1000:0})

0     1
1   NaN
2     2
3   NaN
4     0
5     3
dtype: float64

## 7.3.4 축 색인 이름바꾸기

In [144]:
data=DataFrame(np.arange(12).reshape((3,4)),
              index=['Ohio','Colorado','New York'],
              columns=['one','two','three','four'])

In [145]:
data.index.map(str.upper)

array(['OHIO', 'COLORADO', 'NEW YORK'], dtype=object)

In [146]:
data.index=data.index.map(str.upper)

In [147]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [148]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [149]:
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [150]:
_=data.rename(index={'OHIO':'INDIANA'},inplace=True)

In [151]:
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

## 7.3.5 개별화와 양자화

In [152]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [153]:
bins=[18,25,35,60,100]

In [155]:
cats=pd.cut(ages,bins)

In [156]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [157]:
cats.labels

/Users/HeoJooSeong/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/pandas/core/categorical.py:420: FutureWarning: 'labels' is deprecated. Use 'codes' instead
  warnings.warn("'labels' is deprecated. Use 'codes' instead", FutureWarning)

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [158]:
cats.levels

/Users/HeoJooSeong/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/pandas/core/categorical.py:472: FutureWarning: Accessing 'levels' is deprecated, use 'categories'
  warn("Accessing 'levels' is deprecated, use 'categories'", FutureWarning)

Index([u'(18, 25]', u'(25, 35]', u'(35, 60]', u'(60, 100]'], dtype='object')

In [159]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [160]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, object): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [161]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']

In [162]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [163]:
data=np.random.rand(20)

In [164]:
pd.cut(data,4,precision=2)

[(0.017, 0.26], (0.26, 0.51], (0.017, 0.26], (0.75, 1], (0.51, 0.75], ..., (0.75, 1], (0.75, 1], (0.26, 0.51], (0.51, 0.75], (0.51, 0.75]]
Length: 20
Categories (4, object): [(0.017, 0.26] < (0.26, 0.51] < (0.51, 0.75] < (0.75, 1]]

In [165]:
data=np.random.randn(1000)

In [166]:
cats=pd.qcut(data,4)

In [167]:
cats

[(-0.0203, 0.682], [-3.0723, -0.707], (-0.0203, 0.682], (0.682, 3.649], (-0.0203, 0.682], ..., (-0.0203, 0.682], (-0.0203, 0.682], [-3.0723, -0.707], [-3.0723, -0.707], (0.682, 3.649]]
Length: 1000
Categories (4, object): [[-3.0723, -0.707] < (-0.707, -0.0203] < (-0.0203, 0.682] < (0.682, 3.649]]

In [168]:
pd.value_counts(cats)

(0.682, 3.649]       250
(-0.0203, 0.682]     250
(-0.707, -0.0203]    250
[-3.0723, -0.707]    250
dtype: int64

In [169]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-0.0203, 1.332], [-3.0723, -1.304], (-0.0203, 1.332], (-0.0203, 1.332], (-0.0203, 1.332], ..., (-0.0203, 1.332], (-0.0203, 1.332], (-1.304, -0.0203], (-1.304, -0.0203], (-0.0203, 1.332]]
Length: 1000
Categories (4, object): [[-3.0723, -1.304] < (-1.304, -0.0203] < (-0.0203, 1.332] < (1.332, 3.649]]

## 7.3.6 특이값 찾아내고 제외하기

In [171]:
np.random.seed(12345)

In [172]:
data=DataFrame(np.random.randn(1000,4))

In [173]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [174]:
col=data[3]

In [175]:
col[np.abs(col)>3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [176]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [177]:
data[np.abs(data)>3]=np.sign(data)*3

In [178]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000